var size = 8;
var titlediv;
var rects;

var char;
var divs1,divs2;
var startx,starty;
var direction;
var wordlen;

var clockdiv;
var sec, min;
var counttimer;

var answershown;
var answers;
var nanswers;

var endbutton;
var resetbutton;

function count(){
    sec += 1;
    if(sec >= 60){
	min += 1;
	sec = 0;
    }
    clockdiv.innerHTML = min + ':' + ('00'+sec).substr(-2,2);
    counttimer = setTimeout('count()',1000);
}

function init(){
    titlediv = document.createElement('div');
    titlediv.style.position = 'absolute';
    document.body.appendChild(titlediv);
    
    resetbutton = document.createElement('input');
    resetbutton.type = "button";
    resetbutton.value = '開始';
    resetbutton.style.backgroundColor = '#eee';
    resetbutton.style.width = '20%';
    resetbutton.style.height = '100%';
    resetbutton.style.cssFloat = 'left';
    resetbutton.addEventListener('click',reset,true);
    titlediv.appendChild(resetbutton);
    
    answers = document.createElement('div');
    answers.style.height = '100%';
    answers.style.cssFloat = 'left';
    titlediv.appendChild(answers);
    
    clockdiv = document.createElement('div');
    clockdiv.style.height = '100%';
    clockdiv.style.cssFloat = 'left';
    titlediv.appendChild(clockdiv);
    
    endbutton = document.createElement('input');
    endbutton.type = "button";
    endbutton.value = '終了';
    endbutton.style.backgroundColor = '#eee';
    endbutton.style.width = '20%';
    endbutton.style.height = '100%';
    endbutton.style.cssFloat = 'right';
    endbutton.addEventListener('click',showanswer,true);
    titlediv.appendChild(endbutton);
    
    rects = document.createElement('div');
    rects.style.position = 'absolute';
    document.body.appendChild(rects);
    
    var i,x,y;
    divs1 = new Array(size);
    divs2 = new Array(size);
    for(i=0;i<size;i++){
	divs1[i] = new Array(size);
	divs2[i] = new Array(size);
    }
    for(y=0;y<size;y++){
	for(x=0;x<size;x++){
	    var e = document.createElement('div');
	    e.style.position = 'absolute';
	    e.style.backgroundColor = '#333';
	    rects.appendChild(e);
	    divs1[y][x] = e;
	    
	    var f = document.createElement('div');
	    f.innerHTML = '幹';
	    e.appendChild(f);
	    divs2[y][x] = f;
	}
    }
}

function setsize(){
    var height = window.innerHeight;            // 表示領域の高さ
    var width = window.innerWidth;              // 表示領域の幅
    var titleheight = height * 1/20;            // タイトル高さ
    var framewidth = Math.min(height,width) * 1/40;
    
    //var minsize = Math.min(height-(titleheight*3/2),width);
    var minsize = Math.min(height-(framewidth*2)-(titleheight*3),width-(framewidth*2));
    
    var winsize = minsize;
    
    titlediv.style.top = framewidth+titleheight;
    titlediv.style.left = (width-winsize)/2;
    titlediv.style.width = winsize;
    titlediv.style.height = titleheight;
    
    clockdiv.style.fontSize = titleheight * 6 / 10;
    clockdiv.style.marginLeft = titleheight;
    
    answers.style.fontSize = titleheight * 6 / 10;
    answers.style.marginLeft = titleheight;
    
    resetbutton.style.fontSize = titleheight * 6 / 10;
    endbutton.style.fontSize = titleheight * 6 / 10;
    
    rects.style.top = titleheight + framewidth + titleheight * 2;
    rects.style.left = (width-winsize)/2;
    rects.style.width = winsize;
    rects.style.height = winsize;
    
    var gap = winsize / 180;
    var charsize = (winsize - gap * (size-1)) / size;
    
    var x,y;;
    for(y=0;y<size;y++){
	for(x=0;x<size;x++){
	    var e = divs1[y][x];
	    e.style.width = charsize-gap;
	    e.style.height = charsize-gap;
	    e.style.top = y * charsize + gap * y;
	    e.style.left = x * charsize + gap * x;
	    e.style.backgroundColor = '#555';
	    
	    var f = divs2[y][x];
	    f.style.marginTop = 2;
	    f.style.marginLeft = 6;
	    f.style.fontSize = charsize * 7 / 10;
	    f.style.color = 'white';
	}
    }
    
    chars = new Array(size);
    for(i=0;i<size;i++){
	chars[i] = new Array(size);
    }
}

function rand(n){
    return Math.floor(Math.random() * n);
}

var worddic = [
    "天下一品",
    "マラソン",
    "弱肉強食",
    "臥薪嘗胆",
    "天気予報",
    "明治神宮",
    "徳川家康",
    "先手必勝",
    "九死一生",
    "起死回生",
    "一発逆転",
    "国士無双",
    "人生劇場",
    "焼肉定食",
    "四面楚歌",
    "東海道線",
    "一人天下",
    "一人息子",
    "一刀両断",
    "一刻千金",
    "一品料理",
    "一子相伝",
    "一字千金",
    "一寸法師",
    "一心不乱",
    "一心同体",
    "一念発起",
    "一意専心",
    "一所懸命",
    "一挙両得",
    "一方通行",
    "一日千秋",
    "一望千里",
    "一本調子",
    "一杯機嫌",
    "一枚看板",
    "一次産業",
    "一獲千金",
    "一生懸命",
    "一病息災",
    "一知半解",
    "一石二鳥",
    "一粒万倍",
    "一網打尽",
    "一罰百戒",
    "一衣帯水",
    "一視同仁",
    "一触即発",
    "一言半句",
    "一言居士",
    "一諾千金",
    "一連番号",
    "一部始終",
    "一陽来復",
    "一騎当千",
    "七不思議",
    "七言絶句",
    "七転八倒",
    "七転八起",
    "七難八苦",
    "万世不易",
    "万古不易",
    "万有引力",
    "万物流転",
    "三位一体",
    "三千世界",
    "三半規管",
    "三国伝来",
    "三寒四温",
    "三日坊主",
    "三日天下",
    "三権分立",
    "三次産業",
    "三段論法",
    "三百代言",
    "三角定規",
    "三角測量",
    "三角関係",
    "三角関数",
    "三部合唱",
    "三面記事",
    "上意下達",
    "上昇気流",
    "下意上達",
    "下等動物",
    "不労所得",
    "不動明王",
    "不協和音",
    "不可思議",
    "不可抗力",
    "不在地主",
    "不在投票",
    "不定愁訴",
    "不得要領",
    "不快指数",
    "不換紙幣",
    "不老長寿",
    "不良導体",
    "不言実行",
    "不連続線",
    "不随意筋",
    "世界大戦",
    "世界記録",
    "世話女房",
    "世論調査",
    "中央官庁",
    "中央銀行",
    "中央集権",
    "中小企業",
    "中心人物",
    "中性洗剤",
    "中枢神経",
    "中産階級",
    "中華料理",
    "中間小説",
    "主客転倒",
    "主権国家",
    "主権在民",
    "九尺二間",
    "乾布摩擦",
    "予備知識",
    "予防接種",
    "予防注射",
    "事件記者",
    "事務次官",
    "事大主義",
    "事実無根",
    "事後承諾",
    "二人三脚",
    "二六時中",
    "二十世紀",
    "二十四気",
    "二度手間",
    "二律背反",
    "二束三文",
    "二枚目半",
    "二次産業",
    "二次製品",
    "二百十日",
    "二者択一",
    "二進一退",
    "二部合唱",
    "二重人格",
    "二重価格",
    "二重否定",
    "五十三次",
    "五十音図",
    "五月人形",
    "五月雨式",
    "五段活用",
    "五種競技",
    "五言絶句",
    "五里霧中",
    "五風十雨",
    "交感神経",
    "交換条件",
    "交通事故",
    "交通機関",
    "亭主関白",
    "人事不省",
    "人事異動",
    "人代名詞",
    "人口密度",
    "人名漢字",
    "人定尋問",
    "人工呼吸",
    "人工心肺",
    "人工栄養",
    "人工衛星",
    "人工頭脳",
    "人文地理",
    "人文科学",
    "人気商売",
    "人気投票",
    "人海戦術",
    "人生行路",
    "人跡未踏",
    "人身事故",
    "人身売買",
    "人身攻撃",
    "人道主義",
    "人間国宝",
    "人間工学",
    "人間形成",
    "人間疎外",
    "人間関係",
    "人面獣心",
    "他人行儀",
    "他力本願",
    "他流試合",
    "付加価値",
    "付和雷同",
    "仮性近視",
    "仮装行列",
    "任意出頭",
    "任意捜査",
    "会席料理",
    "会者定離",
    "会計年度",
    "伴食宰相",
    "位階勲等",
    "低温殺菌",
    "低空飛行",
    "住民登録",
    "佳人薄命",
    "価値判断",
    "便宜主義",
    "促成栽培",
    "保護貿易",
    "信任投票",
    "信用金庫",
    "信託統治",
    "信託銀行",
    "信賞必罰",
    "修学旅行",
    "個人主義",
    "停滞前線",
    "健康保険",
    "健康診断",
    "傍若無人",
    "傲岸不遜",
    "傷害保険",
    "億万長者",
    "優勝劣敗",
    "優柔不断",
    "元気溌溂",
    "先制攻撃",
    "先史時代",
    "先憂後楽",
    "先手必勝",
    "先決問題",
    "光学器械",
    "光彩陸離",
    "免許皆伝",
    "児童憲章",
    "児童文学",
    "児童遊園",
    "全体主義",
    "全力投球",
    "全権委員",
    "八分音符",
    "八方美人",
    "八面六臂",
    "公共事業",
    "公共団体",
    "公共料金",
    "公定価格",
    "公定歩合",
    "公平無私",
    "公序良俗",
    "公式主義",
    "公明正大",
    "公正証書",
    "公益事業",
    "公衆衛生",
    "公衆道徳",
    "公衆電話",
    "六十余州",
    "六根清浄",
    "六法全書",
    "共同募金",
    "共同戦線",
    "共済組合",
    "共産主義",
    "内剛外柔",
    "内容証明",
    "内憂外患",
    "内政干渉",
    "内柔外剛",
    "内燃機関",
    "円卓会議",
    "円転滑脱",
    "写実主義",
    "写真植字",
    "冠婚葬祭",
    "冷却期間",
    "冷水摩擦",
    "冷血動物",
    "処女航海",
    "出先機関",
    "出処進退",
    "出刃包丁",
    "初志貫徹",
    "初等教育",
    "別件逮捕",
    "利他主義",
    "利害得失",
    "利害関係",
    "利己主義",
    "利用価値",
    "前人未到",
    "前代未聞",
    "前後不覚",
    "前駆症状",
    "剛毅木訥",
    "剛毅朴訥",
    "創意工夫",
    "助平根性",
    "労働争議",
    "労働協約",
    "労働条件",
    "労働災害",
    "労働組合",
    "労働運動",
    "労災保険",
    "動脈硬化",
    "勝手次第",
    "勤倹力行",
    "勧善懲悪",
    "化学反応",
    "化学療法",
    "化学繊維",
    "化学肥料",
    "北回帰線",
    "北斗七星",
    "十七文字",
    "十万億土",
    "十中八九",
    "十二指腸",
    "十二音階",
    "十字砲火",
    "十年一日",
    "十年一昔",
    "十種競技",
    "千両役者",
    "千古不易",
    "千変万化",
    "千客万来",
    "千差万別",
    "千思万考",
    "千手観音",
    "千紫万紅",
    "千編一律",
    "千言万語",
    "千軍万馬",
    "千載一遇",
    "千辛万苦",
    "半身不随",
    "協同組合",
    "協議離婚",
    "南北戦争",
    "南十字星",
    "南回帰線",
    "南極大陸",
    "南無三宝",
    "南船北馬",
    "単刀直入",
    "単科大学",
    "単記投票",
    "単音文字",
    "博覧強記",
    "印象主義",
    "印象批評",
    "危急存亡",
    "危機一髪",
    "即身成仏",
    "原始時代",
    "原子爆弾",
    "原生動物",
    "参勤交代",
    "反対尋問",
    "反対給付",
    "反射運動",
    "反面教師",
    "収入印紙",
    "取捨選択",
    "口承文学",
    "口述筆記",
    "口述試験",
    "口頭試問",
    "古今東西",
    "古今独歩",
    "可能動詞",
    "司法書士",
    "各種学校",
    "合名会社",
    "合従連衡",
    "合成樹脂",
    "合成洗剤",
    "合成皮革",
    "合成繊維",
    "合理主義",
    "合資会社",
    "吉凶禍福",
    "同人雑誌",
    "同位元素",
    "同名異人",
    "同工異曲",
    "同床異夢",
    "同時通訳",
    "同盟罷業",
    "名古屋帯",
    "名字帯刀",
    "名目賃金",
    "名誉教授",
    "名誉棄損",
    "名論卓説",
    "含水炭素",
    "呉越同舟",
    "和洋折衷",
    "和独辞典",
    "和英辞典",
    "和製英語",
    "和魂漢才",
    "品種改良",
    "品行方正",
    "品質管理",
    "唐草模様",
    "唯一無二",
    "唯我独尊",
    "唯物史観",
    "商事会社",
    "問題意識",
    "喜怒哀楽",
    "器械体操",
    "器用貧乏",
    "四六時中",
    "四分五裂",
    "四分音符",
    "四十九日",
    "四十八手",
    "四捨五入",
    "四段活用",
    "四面楚歌",
    "因数分解",
    "因果応報",
    "因果関係",
    "団体交渉",
    "団体行動",
    "固定観念",
    "固定資産",
    "固有名詞",
    "国会議員",
    "国務大臣",
    "国務長官",
    "国勢調査",
    "国定公園",
    "国民宿舎",
    "国民審査",
    "国民年金",
    "国民所得",
    "国民投票",
    "国立公園",
    "国粋主義",
    "国語辞典",
    "国際空港",
    "国際結婚",
    "国際連合",
    "国際電話",
    "圧力団体",
    "圧搾空気",
    "在外公館",
    "在郷軍人",
    "地下資源",
    "地下足袋",
    "地域社会",
    "地場産業",
    "地方分権",
    "地質時代",
    "垂直分布",
    "執行猶予",
    "基幹産業",
    "堅忍不抜",
    "報道機関",
    "士農工商",
    "士魂商才",
    "声帯模写",
    "変格活用",
    "変温動物",
    "夏炉冬扇",
    "外交辞令",
    "外剛内柔",
    "外国為替",
    "外字新聞",
    "外柔内剛",
    "外郭団体",
    "多岐亡羊",
    "多角経営",
    "夜光塗料",
    "夜郎自大",
    "夢見心地",
    "大同団結",
    "大同小異",
    "大名旅行",
    "大名行列",
    "大和時代",
    "大器晩成",
    "大政奉還",
    "大義名分",
    "大胆不敵",
    "大衆文学",
    "大言壮語",
    "大選挙区",
    "大量生産",
    "大願成就",
    "天下一品",
    "天地無用",
    "天地神明",
    "天地開闢",
    "天変地異",
    "天気予報",
    "天涯孤独",
    "天災地変",
    "天皇陛下",
    "天真爛漫",
    "天衣無縫",
    "太陽電池",
    "夫唱婦随",
    "失業保険",
    "奇想天外",
    "奉納試合",
    "奮起一番",
    "女人禁制",
    "女尊男卑",
    "妄言多謝",
    "姉妹都市",
    "姓名判断",
    "孤立無援",
    "孤軍奮闘",
    "宇宙中継",
    "安心立命",
    "完全変態",
    "完全無欠",
    "完全試合",
    "完全雇用",
    "官尊民卑",
    "定期預金",
    "定温動物",
    "定点観測",
    "実働時間",
    "実力行使",
    "実存主義",
    "実況放送",
    "実用新案",
    "実質賃金",
    "実際問題",
    "室町時代",
    "家内工業",
    "家宅捜索",
    "家庭教師",
    "家族制度",
    "寂滅為楽",
    "富国強兵",
    "寒冷前線",
    "寸借詐欺",
    "対症療法",
    "対面交通",
    "封建主義",
    "封建制度",
    "封建時代",
    "専任講師",
    "専売特許",
    "尋常一様",
    "小料理屋",
    "小春日和",
    "小生意気",
    "小笠原流",
    "小選挙区",
    "小雨決行",
    "山川草木",
    "山紫水明",
    "島国根性",
    "巡航速度",
    "工作機械",
    "巧言令色",
    "市中銀行",
    "市場調査",
    "希少価値",
    "帝国主義",
    "帝王切開",
    "常套手段",
    "常用漢字",
    "平和共存",
    "平均余命",
    "平均寿命",
    "平安時代",
    "平衡感覚",
    "平身低頭",
    "年中行事",
    "年功序列",
    "年季奉公",
    "年次休暇",
    "広大無辺",
    "廃品回収",
    "廃藩置県",
    "弊衣破帽",
    "弱肉強食",
    "強制執行",
    "強迫観念",
    "当座預金",
    "当意即妙",
    "当用漢字",
    "形容動詞",
    "形式動詞",
    "形式名詞",
    "形式用言",
    "形成外科",
    "後生大事",
    "徒手体操",
    "得意満面",
    "御朱印船",
    "御殿女中",
    "心機一転",
    "心理描写",
    "心神喪失",
    "心神耗弱",
    "心頭滅却",
    "思案投首",
    "急行列車",
    "急転直下",
    "恐悦至極",
    "恒温動物",
    "悪口雑言",
    "悪戦苦闘",
    "情状酌量",
    "意味深長",
    "意志薄弱",
    "意思表示",
    "意気投合",
    "意気消沈",
    "意気阻喪",
    "意馬心猿",
    "愛別離苦",
    "感慨無量",
    "感覚器官",
    "懐中時計",
    "懐中電灯",
    "懐石料理",
    "成人教育",
    "我田引水",
    "戦国時代",
    "戸籍抄本",
    "戸籍謄本",
    "所帯道具",
    "手形割引",
    "手旗信号",
    "手間仕事",
    "才子多病",
    "才気煥発",
    "才色兼備",
    "扶養家族",
    "抑制栽培",
    "投資信託",
    "抗生物質",
    "抱腹絶倒",
    "拈華微笑",
    "拒否反応",
    "拒絶反応",
    "指名手配",
    "指導主事",
    "指導原理",
    "挙国一致",
    "排仏棄釈",
    "採長補短",
    "接続助詞",
    "推理小説",
    "換骨奪胎",
    "援護射撃",
    "損害保険",
    "摂関政治",
    "操業短縮",
    "支離滅裂",
    "政務次官",
    "政治結社",
    "政略結婚",
    "故事成語",
    "故事来歴",
    "救急病院",
    "敗北主義",
    "教条主義",
    "教育課程",
    "整形外科",
    "整形手術",
    "文人墨客",
    "文化住宅",
    "文化勲章",
    "文化遺産",
    "文字言語",
    "文教地区",
    "文明開化",
    "文武両道",
    "文芸復興",
    "新約聖書",
    "新進気鋭",
    "新陳代謝",
    "方向転換",
    "既成概念",
    "日常茶飯",
    "日曜大工",
    "日曜学校",
    "日本三景",
    "日本列島",
    "日本脳炎",
    "日本銀行",
    "日進月歩",
    "旧態依然",
    "旧約聖書",
    "明治維新",
    "明窓浄机",
    "明鏡止水",
    "春夏秋冬",
    "昼夜兼行",
    "時代考証",
    "時代錯誤",
    "時限爆弾",
    "普茶料理",
    "普通名詞",
    "普通選挙",
    "普通預金",
    "晴耕雨読",
    "暑中休暇",
    "暖衣飽食",
    "暗中模索",
    "暗黒大陸",
    "暗黒時代",
    "書類送検",
    "最後通告",
    "最高学府",
    "月下氷人",
    "有価証券",
    "有刺鉄線",
    "有史以来",
    "有名無実",
    "有害無益",
    "有性生殖",
    "有機化学",
    "有機水銀",
    "有機肥料",
    "有為転変",
    "有産階級",
    "有線放送",
    "有色人種",
    "有言実行",
    "有限会社",
    "朝三暮四",
    "朝令暮改",
    "木管楽器",
    "未来永劫",
    "本位貨幣",
    "本末転倒",
    "条件反射",
    "杯中蛇影",
    "杯盤狼藉",
    "東奔西走",
    "東海地方",
    "東高西低",
    "林間学校",
    "枝葉末節",
    "栄枯盛衰",
    "栄養失調",
    "株式会社",
    "桃山時代",
    "梅雨前線",
    "森羅万象",
    "植物人間",
    "検事総長",
    "極楽往生",
    "極楽浄土",
    "極超短波",
    "楽天主義",
    "槿花一日",
    "模擬試験",
    "権謀術数",
    "権謀術策",
    "横断歩道",
    "機会均等",
    "機動部隊",
    "機械文明",
    "欠席裁判",
    "欲求不満",
    "正三角形",
    "正当防衛",
    "武家時代",
    "武者人形",
    "武者修行",
    "武陵桃源",
    "歴史小説",
    "死後硬直",
    "死活問題",
    "残念至極",
    "残酷非道",
    "殺生禁断",
    "母子年金",
    "母子手帳",
    "比例配分",
    "比較多数",
    "毛管現象",
    "毛細血管",
    "民主政治",
    "民族主義",
    "民族自決",
    "民生委員",
    "民間放送",
    "気炎万丈",
    "気象衛星",
    "水上競技",
    "水中眼鏡",
    "水中翼船",
    "水先案内",
    "水力発電",
    "水平分布",
    "水素爆弾",
    "氷河時代",
    "永字八法",
    "汗牛充棟",
    "江戸時代",
    "決選投票",
    "沈思黙考",
    "治乱興亡",
    "治外法権",
    "波乱万丈",
    "注意人物",
    "泰然自若",
    "活殺自在",
    "活用語尾",
    "流言飛語",
    "浄土真宗",
    "消化不良",
    "液体酸素",
    "深謀遠慮",
    "混声合唱",
    "清廉潔白",
    "清浄野菜",
    "清涼飲料",
    "清濁併呑",
    "減価償却",
    "温故知新",
    "温暖前線",
    "温血動物",
    "満場一致",
    "源泉課税",
    "準体助詞",
    "滅私奉公",
    "漢和辞典",
    "潜在意識",
    "火力発電",
    "火災保険",
    "炉辺談話",
    "炭水化物",
    "為替相場",
    "無味乾燥",
    "無学文盲",
    "無性生殖",
    "無我夢中",
    "無手勝流",
    "無援孤立",
    "無機化学",
    "無理心中",
    "無理算段",
    "無理難題",
    "無産階級",
    "無病息災",
    "無線操縦",
    "無線電信",
    "無線電話",
    "無銭飲食",
    "無間地獄",
    "無限軌道",
    "焦点距離",
    "焦熱地獄",
    "焼身自殺",
    "熟慮断行",
    "爆弾発言",
    "片言隻語",
    "版籍奉還",
    "牛飲馬食",
    "物価指数",
    "物情騒然",
    "物理療法",
    "物見遊山",
    "物質文明",
    "特別国会",
    "特権階級",
    "特異体質",
    "特筆大書",
    "独和辞典",
    "独断専行",
    "独立自尊",
    "率先垂範",
    "玉石混交",
    "王侯貴族",
    "現世利益",
    "現在完了",
    "現実主義",
    "現金書留",
    "理想主義",
    "理路整然",
    "生命保険",
    "生存競争",
    "生年月日",
    "生死事大",
    "生殺与奪",
    "生活保護",
    "生者必滅",
    "生臭坊主",
    "産児制限",
    "産婦人科",
    "産業革命",
    "用意周到",
    "田舎汁粉",
    "甲骨文字",
    "男女共学",
    "男女同権",
    "男尊女卑",
    "略式命令",
    "異体同心",
    "異口同音",
    "異国情緒",
    "異字同訓",
    "異母兄弟",
    "疑心暗鬼",
    "疲労困憊",
    "疾風迅雷",
    "発光塗料",
    "発声器官",
    "発育不全",
    "登場人物",
    "登録商標",
    "白河夜船",
    "白熱電球",
    "白砂青松",
    "白色人種",
    "百万長者",
    "百人一首",
    "百八十度",
    "百八煩悩",
    "百家争鳴",
    "百戦錬磨",
    "百科事典",
    "百科全書",
    "百鬼夜行",
    "盛者必衰",
    "直情径行",
    "直接行動",
    "直接選挙",
    "相互扶助",
    "相互銀行",
    "相即不離",
    "相撲部屋",
    "真一文字",
    "真剣勝負",
    "知者不惑",
    "知能指数",
    "知能検査",
    "知行合一",
    "知識階級",
    "短日植物",
    "短期大学",
    "石器時代",
    "石油乳剤",
    "砂糖大根",
    "砲煙弾雨",
    "破顔一笑",
    "硫化水素",
    "示威運動",
    "社交辞令",
    "社会主義",
    "社会事業",
    "社会保険",
    "社会保障",
    "社会問題",
    "社会復帰",
    "社会教育",
    "社会生活",
    "社会福祉",
    "社会科学",
    "社会運動",
    "社団法人",
    "祖先伝来",
    "神出鬼没",
    "神経衰弱",
    "神経過敏",
    "祥月命日",
    "禁断症状",
    "福利施設",
    "福祉国家",
    "秋雨前線",
    "秋霜烈日",
    "秘密結社",
    "程度問題",
    "種子植物",
    "穀倉地帯",
    "空中分解",
    "空中楼閣",
    "空前絶後",
    "空気調節",
    "突然変異",
    "窒素肥料",
    "立体交差",
    "立地条件",
    "立憲政治",
    "立身出世",
    "竜頭蛇尾",
    "第一人称",
    "第一人者",
    "第一印象",
    "第三人称",
    "第二人称",
    "第二義的",
    "筆記試験",
    "等差級数",
    "等比級数",
    "算用数字",
    "算術平均",
    "節足動物",
    "簡易保険",
    "米穀年度",
    "粉骨砕身",
    "粗製乱造",
    "精密機械",
    "精神一到",
    "精神分析",
    "精神年齢",
    "精神薄弱",
    "精神衛生",
    "精神鑑定",
    "精進料理",
    "精進潔斎",
    "約束手形",
    "紅白試合",
    "紆余曲折",
    "累進課税",
    "紳士協定",
    "終始一貫",
    "経済観念",
    "絶対多数",
    "絶対安静",
    "総合大学",
    "総合芸術",
    "総合雑誌",
    "総理大臣",
    "総画索引",
    "線香花火",
    "緩急自在",
    "緩衝地帯",
    "縄文時代",
    "縦横無尽",
    "羊頭狗肉",
    "美容体操",
    "美容整形",
    "美辞麗句",
    "美酒佳肴",
    "群雄割拠",
    "群集心理",
    "義務教育",
    "羽化登仙",
    "老少不定",
    "老若男女",
    "老齢年金",
    "耐用年数",
    "職務質問",
    "職場結婚",
    "職業意識",
    "肉体労働",
    "肉食妻帯",
    "育英資金",
    "胆大心小",
    "脳下垂体",
    "脳軟化症",
    "腹式呼吸",
    "臨時国会",
    "臨機応変",
    "臨海学校",
    "臨界温度",
    "自主独立",
    "自動制御",
    "自動小銃",
    "自家中毒",
    "自家用車",
    "自己嫌悪",
    "自己批判",
    "自己暗示",
    "自己紹介",
    "自己顕示",
    "自律神経",
    "自然主義",
    "自然公園",
    "自然現象",
    "自然科学",
    "自然選択",
    "自由主義",
    "自由奔放",
    "自由平等",
    "自由意志",
    "自由経済",
    "自由行動",
    "自由貿易",
    "自覚症状",
    "至上命令",
    "舌先三寸",
    "航空母艦",
    "艦砲射撃",
    "良妻賢母",
    "艱難辛苦",
    "色即是空",
    "花嫁御寮",
    "花鳥風月",
    "英和辞典",
    "草根木皮",
    "蒸気機関",
    "薄利多売",
    "薄志弱行",
    "薬師如来",
    "虚無主義",
    "融通手形",
    "血液銀行",
    "血清肝炎",
    "行動半径",
    "行路病者",
    "行雲流水",
    "衛星都市",
    "衣冠束帯",
    "表意文字",
    "表裏一体",
    "表面張力",
    "表音文字",
    "被保険者",
    "被修飾語",
    "被害妄想",
    "被選挙人",
    "被選挙権",
    "補助動詞",
    "補助用言",
    "複合競技",
    "複式学級",
    "西方浄土",
    "西高東低",
    "親善試合",
    "観光都市",
    "観葉植物",
    "言文一致",
    "言行一致",
    "言語生活",
    "言語道断",
    "言語障害",
    "言論機関",
    "設備投資",
    "証券会社",
    "証拠物件",
    "試行錯誤",
    "試験地獄",
    "誇大妄想",
    "認識不足",
    "誘導尋問",
    "読書尚友",
    "談論風発",
    "論功行賞",
    "諸行無常",
    "警視総監",
    "豊作貧乏",
    "象形文字",
    "財団法人",
    "貨幣価値",
    "資本主義",
    "賛否両論",
    "質実剛健",
    "質疑応答",
    "購買組合",
    "起承転結",
    "起死回生",
    "起訴猶予",
    "超過勤務",
    "路面電車",
    "身体検査",
    "身体髪膚",
    "身分相応",
    "車間距離",
    "軍司令官",
    "軍国主義",
    "軍法会議",
    "軟体動物",
    "軽佻浮薄",
    "軽便鉄道",
    "軽挙妄動",
    "軽自動車",
    "輸入超過",
    "輸出超過",
    "迅速果敢",
    "近所迷惑",
    "近視眼的",
    "迷走神経",
    "退職年金",
    "途中下車",
    "通俗小説",
    "通信教育",
    "通信機関",
    "通信衛星",
    "通信販売",
    "通常国会",
    "速戦即決",
    "造形美術",
    "造語成分",
    "連帯責任",
    "連立内閣",
    "連記投票",
    "連鎖反応",
    "連鎖球菌",
    "遊動円木",
    "運動神経",
    "運否天賦",
    "運転資金",
    "過大評価",
    "過失傷害",
    "過失致死",
    "過小評価",
    "過当競争",
    "道路標識",
    "遠交近攻",
    "遠慮会釈",
    "遠水近火",
    "遠隔操作",
    "適性検査",
    "適者生存",
    "選外佳作",
    "選挙運動",
    "部首索引",
    "郵便切手",
    "郵便年金",
    "郵便振替",
    "郵便書簡",
    "郵便為替",
    "郵便番号",
    "郵便貯金",
    "都市計画",
    "都市銀行",
    "都道府県",
    "酒池肉林",
    "酔生夢死",
    "酸性反応",
    "酸素吸入",
    "酸素溶接",
    "金城湯池",
    "金城鉄壁",
    "金殿玉楼",
    "金科玉条",
    "金管楽器",
    "金融機関",
    "針小棒大",
    "鉄器時代",
    "鉄心石腸",
    "門前雀羅",
    "門外不出",
    "門戸開放",
    "開店休業",
    "閑話休題",
    "間接選挙",
    "陣頭指揮",
    "陸上競技",
    "陽動作戦",
    "隔世遺伝",
    "障害競走",
    "隠忍自重",
    "集中豪雨",
    "集団検診",
    "集積回路",
    "雇用保険",
    "雌伏雄飛",
    "離合集散",
    "難攻不落",
    "雨天順延",
    "雲散霧消",
    "雲集霧散",
    "零細企業",
    "電信為替",
    "電光石火",
    "電報為替",
    "電子工学",
    "電子頭脳",
    "電気分解",
    "電気抵抗",
    "電源開発",
    "震天動地",
    "霊魂不滅",
    "青天白日",
    "青色申告",
    "非常手段",
    "非戦闘員",
    "非行少年",
    "非鉄金属",
    "面張牛皮",
    "面従腹背",
    "面目躍如",
    "音声言語",
    "音標文字",
    "音節文字",
    "音響効果",
    "順序不同",
    "順風満帆",
    "頭寒足熱",
    "頭脳労働",
    "顕花植物",
    "風俗営業",
    "風林火山",
    "風致地区",
    "飛耳長目",
    "飛行機雲",
    "食虫植物",
    "飽食暖衣",
    "養護施設",
    "首尾一貫",
    "馬耳東風",
    "驚天動地",
    "高山植物",
    "高等動物",
    "高等学校",
    "高速道路",
    "高野豆腐",
    "鬼子母神",
    "鯨飲馬食",
    "鳩首凝議",
    "鶏口牛後",
    "黄色人種",
    "黄道吉日",
    "黄金分割",
    "黄金時代",
    "黒色人種"
];
var word = worddic[0];

function calcchars(){
    var i,x,y,s;
    word = worddic[rand(worddic.length)];
    answershown = false;
    
    var words = word.split('');
    wordlen = word.length;
    var count = 0;
    while(count != 1){
	count = 0;
	//
	// ランダムに文字を割り当て
	//
	for(y=0;y<size;y++){
	    for(x=0;x<size;x++){
		/*
		 // これは普通のランダム計算。
		 chars[y][x] = words[rand(wordlen)];
		 */
		// 周囲と異なるものの優先度を上げてみよう
		w = []
		for(i=0;i<wordlen;i++){
		    c = words[i];
		    if(x > 0 && chars[y][x-1] == c){
			w.push(c);
		    }
		    else if(y > 0 && chars[y-1][x] == c){
			w.push(c);
		    }
		    else {
			w.push(c);
			w.push(c);
			w.push(c);
			w.push(c);
			w.push(c);
		    }
		}
		chars[y][x] = w[rand(w.length)];
	    }
	}
	//
	// 文字列にマッチするか検索。あればランダムに置換。
	//
	for(y=0;y<size;y++){
	    for(x=0;x<size-wordlen;x++){
		s = '';
		for(i=0;i<wordlen;i++){
		    s += chars[y][x+i];
		}
		if(word == s){ // 一致するものがみつかったら再計算
		    count = -1;
		    for(i=0;i<wordlen;i++){
			chars[y][x+i] = words[rand(wordlen)];
		    }
		}
	    }
	}
	for(y=0;y<size-wordlen;y++){
	    for(x=0;x<size;x++){
		s = '';
		for(i=0;i<wordlen;i++){
		    s += chars[y+i][x];
		}
		if(word == s){ // 一致するものがみつかったら再計算
		    count = -1;
		    for(i=0;i<wordlen;i++){
			chars[y+i][x] = words[rand(wordlen)];
		    }
		}
	    }
	}
	if(count == 0){ // 一致するものがみつからなかったとき
	    //
	    //ランダムな場所に正しい文字列を埋め込む
	    //
	    if(rand(2) == 0){
		direction = 'x';
		startx = rand(size-wordlen);
		starty = rand(size);
		for(i=0;i<wordlen;i++){
		    chars[starty][startx+i] = words[i];
		}
	    }
	    else {
		direction = 'y';
		startx = rand(size);
		starty = rand(size-wordlen);
		for(i=0;i<wordlen;i++){
		    chars[starty+i][startx] = words[i];
		}
	    }
	    // 正解をクリックすると次の問題へ
	    for(y=0;y<size;y++){
		for(x=0;x<size;x++){
		    divs2[y][x].removeEventListener('click',correctanswer, true);
		}
	    }
	    if(direction == 'x'){
		for(i=0;i<4;i++){
		    divs2[starty][startx+i].addEventListener('click',correctanswer, true);
		}
	    }
	    else {
		for(i=0;i<4;i++){
		    divs2[starty+i][startx].addEventListener('click',correctanswer, true);
		}
	    }
	    //
	    // ユニークかどうか検証
	    for(y=0;y<size;y++){
		for(x=0;x<size-wordlen;x++){
		    s = '';
		    for(i=0;i<wordlen;i++){
			s += chars[y][x+i];
		    }
		    if(word == s){
			count += 1;
		    }
		}
	    }
	    for(y=0;y<size-wordlen;y++){
		for(x=0;x<size;x++){
		    s = '';
		    for(i=0;i<wordlen;i++){
			s += chars[y+i][x];
		    }
		    if(word == s){
			count += 1;
		    }
		}
	    }
	}
    }
}

function display(){
    var i,x,y;
    
    answers.innerHTML = answered + "問正解";
    
    var height = window.innerHeight;
    var width = window.innerWidth;
    var winsize = Math.min(height,width);
    // alert("height="+height+", width="+width);
    var charsize = Math.floor(winsize / size / 2);
    
    for(var y=0;y<size;y++){
	for(var x=0;x<size;x++){
	    divs2[y][x].innerHTML = chars[y][x];
	    divs2[y][x].style.color = 'white';
	}
    }
}

function showanswer(){
    var i;
    if(direction == 'x'){
	for(i=0;i<wordlen;i++){
	    divs2[starty][startx+i].style.color = 'yellow';
	}
    }
    else {
	for(i=0;i<wordlen;i++){
	    divs2[starty+i][startx].style.color = 'yellow';
	}
    }
    clearTimeout(counttimer);
    answershown = true;
}

function correctanswer(){
    if(! answershown){
	answered += 1;
	calcchars();
	display();
    }
}

function reset(){
    min = 0;
    sec = 0;
    clockdiv.innerHTML = "0:00";
    clearTimeout(counttimer);
    counttimer = setTimeout('count()',1000);
    answered = 0;
    answershown = false;
    calcchars();
    display();
}

init();
setsize();
reset();
